/**
 * Copyright (c) 2018 Vertexcom Technologies, Inc. All rights reserved
 * Vertexcom Confidential Proprietary
 *
*/

#include "vcsoc.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

#define SEC_MODE 0
#define ETH_MODE 1

#define AES_128_KEY_SIZE 16
#define AES_192_KEY_SIZE 24
#define AES_256_KEY_SIZE 32

/* see RFC 3610 */
#ifndef CCM_STAR_AUTH_FLAGS
#define CCM_STAR_AUTH_FLAGS(Adata, M) ((Adata ? (1u << 6) : 0) | (((M - 2u) >> 1) << 3) | 1u)
#endif

#ifndef CCM_STAR_ENCRYPTION_FLAGS
#define CCM_STAR_ENCRYPTION_FLAGS     1
#endif

#ifndef CCM_STAR_NONCE_LENGTH
#define CCM_STAR_NONCE_LENGTH 13
#endif

// ----------------------------------------------- CRYPTO DMA Enggine

#define VCDMAC_REG_BASE    0x40018000

struct VCDMAC_CR {
    union {
        struct {
            uint32_t csr_txeng_rstn : 1;
            uint32_t csr_rxeng_rstn : 1;
            uint32_t csr_txbuf_rstn : 1;
            uint32_t csr_rxbuf_rstn : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TM_CR {
    union {
        struct {
            uint32_t csr_dma_lb        : 1;
            uint32_t csr_buf_lb        : 1;
            uint32_t csr_rxstatus_drop : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_CR {
    union {
        struct {
            uint32_t csr_txe_byteswap : 1;
            uint32_t csr_txe_chkfd    : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_SR {
    union {
        struct {
            uint32_t csr_txe_desc_gap : 8;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_KR {
    union {
        struct {
            uint32_t csr_txe_kick : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_BA_SR {
    union {
        struct {
            uint32_t csr_txbase_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_NA_SR {
    union {
        struct {
            uint32_t csr_txnext_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_CA_IR {
    union {
        struct {
            uint32_t csr_txcurr_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_TXE_REQ_IR {
    union {
        struct {
            uint32_t csr_txreq_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_CR {
    union {
        struct {
            uint32_t csr_rxe_byteswap : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_SR {
    union {
        struct {
            uint32_t csr_rxe_desc_gap : 8;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_KR {
    union {
        struct {
            uint32_t csr_rxe_kick : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_BA_SR {
    union {
        struct {
            uint32_t csr_rxbase_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_NA_SR {
    union {
        struct {
            uint32_t csr_rxnext_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_CA_IR {
    union {
        struct {
            uint32_t csr_rxcurr_address : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_REQ_IR {
    union {
        struct {
            uint32_t csr_rxreq_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_RXE_SA_IR {
    union {
        struct {
            uint32_t csr_rxstart_addr : 32;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_IER {
    union {
        struct {
            uint32_t ier_txcmp     : 1;
            uint32_t ier_txunavail : 1;
            uint32_t ier_txerr     : 1;
            uint32_t ier_txupdate  : 1;
            uint32_t ier_reserved  : 4;
            uint32_t ier_rxcmp     : 1;
            uint32_t ier_rxunavail : 1;
            uint32_t ier_rxerr     : 1;
            uint32_t ier_rxupdate  : 1;
            uint32_t ier_rxreclaim : 1;
            uint32_t ier_msterr    : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_ISR {
    union {
        struct {
            uint32_t isr_txcmp     : 1;
            uint32_t isr_txunavail : 1;
            uint32_t isr_txerr     : 1;
            uint32_t isr_txupdate  : 1;
            uint32_t isr_reserved  : 4;
            uint32_t isr_rxcmp     : 1;
            uint32_t isr_rxunavail : 1;
            uint32_t isr_rxerr     : 1;
            uint32_t isr_rxupdate  : 1;
            uint32_t isr_rxreclaim : 1;
            uint32_t isr_msterr    : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_ISTR {
    union {
        struct {
            uint32_t istr_txcmp     : 1;
            uint32_t istr_txunavail : 1;
            uint32_t istr_txerr     : 1;
            uint32_t istr_txupdate  : 1;
            uint32_t reserved       : 4;
            uint32_t istr_rxcmp     : 1;
            uint32_t istr_rxunavail : 1;
            uint32_t istr_rxerr     : 1;
            uint32_t istr_rxupdate  : 1;
            uint32_t istr_rxreclaim : 1;
            uint32_t istr_msterr    : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_REG_SPACE {
    struct VCDMAC_CR           CR;         // 0x00
    uint32_t reserved0;                    // 0x04
    uint32_t reserved1;                    // 0x08
    struct VCDMAC_TM_CR        TM_CR;      // 0x0c
    struct VCDMAC_TXE_CR       TXE_CR;     // 0x10
    struct VCDMAC_TXE_SR       TXE_SR;     // 0x14
    struct VCDMAC_TXE_KR       TXE_KR;     // 0x18
    struct VCDMAC_TXE_BA_SR    TXE_BA_SR;  // 0x1c
    struct VCDMAC_TXE_NA_SR    TXE_NA_SR;  // 0x20
    struct VCDMAC_TXE_CA_IR    TXE_CA_IR;  // 0x24
    struct VCDMAC_TXE_REQ_IR   TXE_REQ_IR; // 0x28
    uint32_t reserved2;                     // 0x2c
    struct VCDMAC_RXE_CR       RXE_CR;     // 0x30
    struct VCDMAC_RXE_SR       RXE_SR;     // 0x34
    struct VCDMAC_RXE_KR       RXE_KR;     // 0x38
    struct VCDMAC_RXE_BA_SR    RXE_BA_SR;  // 0x3c
    struct VCDMAC_RXE_NA_SR    RXE_NA_SR;  // 0x40
    struct VCDMAC_RXE_CA_IR    RXE_CA_IR;  // 0x44
    struct VCDMAC_RXE_REQ_IR   RXE_REQ_IR; // 0x48
    struct VCDMAC_RXE_SA_IR    RXE_SA_IR;  // 0x4c
    struct VCDMAC_IER          IER;        // 0x50
    struct VCDMAC_ISR          ISR;        // 0x54
    struct VCDMAC_ISTR         ISTR;       // 0x58
};

struct VCDMAC_DESC_CTRL {
    union {
        struct {
            uint32_t pkt_len        : 16;   // packet length
            uint32_t len_err        : 1;    // decriptor length error
            uint32_t reserved0      : 4;
            uint32_t FCS            : 1;    // FCS error
            uint32_t HCS            : 1;    // HCS error
            uint32_t MIC            : 1;    // MIC (Message Integration Code) error
            uint32_t reserved1      : 3;
            uint32_t last           : 1;    // last descriptor of the packet
            uint32_t first          : 1;    // first descriptor of the packet
            uint32_t int_en         : 1;    // interrupt enable for this descriptor
            uint32_t eor            : 1;    // end of ring
            uint32_t owner          : 1;
        } fields;

        uint32_t value;
    };
};

struct VCDMAC_PAYLOAD {
    void *dma_ptr;
    uint16_t dma_size;
};

#define VCDMAC_STRING_NR_DESC      2
#define VCDMAC_SSRING_NR_DESC      1
#define VCDMAC_TXRING_NR_DESC      6
#define VCDMAC_RXRING_NR_DESC      2

#define VCDMAC_RX_BUF_SIZE     1536
#define VCDMAC_TX_BUF_SIZE     1536

struct VCDMAC_PACKET {
    struct VCDMAC_PAYLOAD pld[VCDMAC_TXRING_NR_DESC];
    uint8_t nr_desc;
};

struct VCDMAC_RING_DESC {
    struct VCDMAC_DESC_CTRL ctrl;
    uint32_t ptr;
    uint32_t reserved0;
    uint32_t reserved1;
    struct VCDMAC_RING_DESC *prev;
    struct VCDMAC_RING_DESC *next;
    struct VCDMAC_RING_DESC *last;
    struct VCDMAC_PACKET *pkt;
};

#define VCDMAC_DESC_SPACING_SIZE   (sizeof(struct VCDMAC_RING_DESC) - 8)

enum VCDMAC_USR {
    VCDMAC_USR_KICKOFF_TX   = 0x08,
};

struct VCDMAC_RING {
    struct VCDMAC_RING_DESC *base;
    const char *name;

    struct VCDMAC_RING_DESC *refill_ptr;
    struct VCDMAC_RING_DESC *reclaim_ptr;

    uint32_t user_flag;

    volatile uint32_t *kickoff;
    volatile uint32_t *hw_ptr;

    uint32_t nr_entries;
};

struct VCDMAC_GLOBAL {
    struct VCDMAC_RING st_ring;        // security-tx crypt ring parameters
    struct VCDMAC_RING sr_ring;        // security-rx crypt ring parameters

    struct VCDMAC_RING t_ring;         // tx crypt ring parameters
    struct VCDMAC_RING r_ring;         // rx crypt ring parameters
};

enum VCDMAC_OWNER {
    VCDMAC_OWNER_SW     = 0,    // the desc entry if free to be used by the software
    VCDMAC_OWNER_DMAC   = 1,    // the desc entry is currently in used by the DMA engine
};

struct VCDMAC_GLOBAL_TRX {
    struct VCDMAC_ISR sec_ISR;

    uint8_t cur_tx_index;
    uint8_t cur_rx_index;

    uint32_t rx_data_ok;
    uint32_t rx_data_error;
    uint32_t rx_crc;
    uint32_t rx_len_error;
    uint32_t tx_ok;

    uint8_t sec_wait_rx_done;
    uint16_t sec_rx_len;
    uint8_t *sec_rx_ptr;

    uint8_t addr_default;
};

// ----------------------------------------------- CRYPTO Enggine

#define VCCRYPT_REG_BASE    0x40019000

struct VCCRYPT_CR {
    union {
        struct {
            uint32_t csr_aes_en : 1;
            uint32_t reserved0  : 3;
            uint32_t csr_sm2_en : 1;
            uint32_t csr_sm3_en : 1;
            uint32_t csr_sm4_en : 1;
            uint32_t reserved1  : 1;
            uint32_t csr_fcs_en : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_RST_CR {
    union {
        struct {
            uint32_t csr_crypto_rstn : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SM2_CR {
    union {
        struct {
            uint32_t csr_sm2_act : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SM2_SR1 {
    union {
        struct {
            uint32_t csr_sm2_mode   : 3;
            uint32_t reserved0      : 1;
            uint32_t csr_sm2_length : 4;
            uint32_t reserved1      : 8;
            uint32_t csr_sm2_ptr_a  : 13;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SM2_SR2 {
    union {
        struct {
            uint32_t csr_sm2_ptr_b : 13;
            uint32_t reserved0     : 3;
            uint32_t csr_sm2_ptr_o : 13;
            uint32_t reserved1     : 3;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SM2_IR {
    union {
        struct {
            uint32_t csr_sm2_done  : 1;
            uint32_t csr_sm2_carry : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SRAM_CR1 {
    union {
        struct {
            uint32_t csr_cry_sram_addr : 13;
            uint32_t reserved0         : 3;
            uint32_t csr_cry_sram_web  : 1;
            uint32_t reserved1         : 7;
            uint32_t csr_cry_sram_req  : 1;
            uint32_t reserved2         : 7;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SRAM_CR2 {
    union {
        struct {
            uint32_t csr_cry_sram_wd : 32;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SRAM_RR1 {
    union {
        struct {
            uint32_t csr_cry_sram_done : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_SRAM_RR2 {
    union {
        struct {
            uint32_t csr_cry_sram_rd : 32;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_CFG_ERR  {
    union {
        struct {
            uint32_t csr_sm3_cfgerr : 1;
            uint32_t csr_sm4_cfgerr : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_FCS_CFG {
    union {
        struct {
            uint32_t csr_fcs8_reginit0     : 1;
            uint32_t csr_fcs8_1com         : 1;
            uint32_t csr_fcs8_flpbyte_in   : 1;
            uint32_t csr_fcs8_flpbyte_out  : 1;
            uint32_t reserved0             : 4;
            uint32_t csr_fcs16_reginit0    : 1;
            uint32_t csr_fcs16_1com        : 1;
            uint32_t csr_fcs16_flpbyte_in  : 1;
            uint32_t csr_fcs16_flpbyte_out : 1;
            uint32_t reserved1             : 4;
            uint32_t csr_fcs24_reginit0    : 1;
            uint32_t csr_fcs24_1com        : 1;
            uint32_t csr_fcs24_flpbyte_in  : 1;
            uint32_t csr_fcs24_flpbyte_out : 1;
            uint32_t reserved2             : 4;
            uint32_t csr_fcs32_reginit0    : 1;
            uint32_t csr_fcs32_1com        : 1;
            uint32_t csr_fcs32_flpbyte_in  : 1;
            uint32_t csr_fcs32_flpbyte_out : 1;
        } fields;

        uint32_t value;
    };
};

struct VCCRYPT_REG_SPACE {
    struct VCCRYPT_CR           CR;             // 0x00
    struct VCCRYPT_RST_CR       RSTN;           // 0x04
    uint32_t                    reserved0;      // 0x08
    uint32_t                    reserved1;      // 0x0C
    struct VCCRYPT_SM2_CR       SM2_CR;         // 0x10
    struct VCCRYPT_SM2_SR1      SM2_SR1;        // 0x14
    struct VCCRYPT_SM2_SR2      SM2_SR2;        // 0x18
    struct VCCRYPT_SM2_IR       SM2_IR;         // 0x1C
    struct VCCRYPT_SRAM_CR1     SRAM_CR1;       // 0x20
    struct VCCRYPT_SRAM_CR2     SRAM_CR2;       // 0x24
    struct VCCRYPT_SRAM_RR1     SRAM_RR1;       // 0x28
    struct VCCRYPT_SRAM_RR2     SRAM_RR2;       // 0x2C
    struct VCCRYPT_CFG_ERR      CFG_ERR;        // 0x30
    struct VCCRYPT_FCS_CFG      FCS_CFG;        // 0x34
};

enum SEC_TYPE {
    VCSEC_TYPE_AES = 1,
    VCSEC_TYPE_SM  = 3,
    VCSEC_TYPE_CRC = 5,
};

enum SEC_AES_TYPE {
    VCSEC_MODE_ECB_128 = 1,
    VCSEC_MODE_CCM_128,
    VCSEC_MODE_CBC_128,
    VCSEC_MODE_ECB_192,
    VCSEC_MODE_CCM_192,
    VCSEC_MODE_CBC_192,
    VCSEC_MODE_ECB_256,
    VCSEC_MODE_CCM_256,
    VCSEC_MODE_CBC_256,
    VCSEC_MODE_MAX,
};

enum SEC_CRC_TYPE
{
    VCSEC_MODE_CRC_32 = 0,
    VCSEC_MODE_CRC_24 = 1,
    VCSEC_MODE_CRC_16 = 2,
    VCSEC_MODE_CRC_8  = 3,
};

enum SEC_AES_KEY_TYPE {
    AES_128 = 0,
    AES_192 = 1,
    AES_256 = 2,
};

enum SEC_SM_TYPE {
    VCSEC_MODE_SM3 = 1,
    VCSEC_MODE_SM4
};

struct VCSEC_CTRL {
    union {
        struct {
            uint32_t mode     : 4;
            uint32_t type     : 4;
            uint32_t head_len : 8;
            uint32_t config   : 8;
            uint32_t sequence : 8;
        } fields;

        uint32_t value;
    };
};

